---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NewCouplerTypeCreated
source: html/05633cfb-accb-a9fe-15f2-b59bc6990876.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NewCouplerTypeCreated Property

A new coupler type was automatically created to fit the bar diameters.

## Syntax (C#)
```csharp
public static FailureDefinitionId NewCouplerTypeCreated { get; }
```